// Задача 50. Напишите программу, которая на вход принимает позиции элемента в двумерном массиве,
//  и возвращает значение этого элемента или же указание, что такого элемента нет.

// Например, задан массив:
// 1 4 7 2
// 5 9 2 3
// 8 4 2 4
// 17 -> такого числа в массиве нет

int ReadInt(string text)
{
    System.Console.Write(text);
    return Convert.ToInt32(Console.ReadLine());
}

int[,] GenerateMatrix(int rows, int cols)
{
    int[,] matrix = new int[rows, cols];

    for (int i = 0; i < matrix.GetLength(0); i++)
    {
        for (int j = 0; j < matrix.GetLength(1); j++)
        {
            matrix[i, j] = new Random().Next(0, 11);
        }
    }
    return matrix;
}

void PrintMatrix(int[,] matrix)
{
    for (int i = 0; i < matrix.GetLength(0); i++)
    {
        for (int j = 0; j < matrix.GetLength(1); j++)
        {
            System.Console.Write(matrix[i, j] + "\t");
        }
        System.Console.WriteLine();
    }
}

void SearchElement(int[,] matr, int searchrows, int searchcols)
{
    if (searchrows >= matr.GetLength(0) || searchcols >= matr.GetLength(1))
    {
        System.Console.WriteLine("Такого элемента не существует");
    }
    else
    {
        int element = matr[searchrows, searchcols];
        System.Console.WriteLine($"Искомый элемент: {element}");
    }

}

int rows = ReadInt("Введите количество строк матрицы: ");
int cols = ReadInt("Введите количество столбцов матрицы: ");
System.Console.WriteLine();
var myMatrix = GenerateMatrix(rows, cols);
PrintMatrix(myMatrix);

int searchrows = ReadInt("Введите индекс строки элемента: ");
int searchcols = ReadInt("Введите индекс столбца элемента: ");
System.Console.WriteLine();
SearchElement(myMatrix, searchrows, searchcols);